app/views/tasks/_form.html.erb

SELECT "levels".* FROM "levels"
---
    <label>Niveau d'importante de la tâche</label>
    <%= t.collection_select :level_id, Level.all, :id, :name, {}, {} %>