app/controllers/levels_controller.rb

  def index
    @levels = Level.all
---
SELECT "levels".* FROM "levels"

  def create
    @level = Level.new(level_params)

    respond_to do |format|
      if @level.save
---
INSERT INTO "levels" ("name", "weight", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Tres important"], ["weight", 1000], ["created_at", 2017-03-26 01:52:53 UTC], ["updated_at", 2017-03-26 01:52:53 UTC]]

    def set_level
      @level = Level.find(params[:id])
---
SELECT  "levels".* FROM "levels" WHERE "levels"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]