app/controllers/tasks_controller.rb

  def complete
    Task.where(id: params[:task_ids]).update_all(check: true)
---
UPDATE "tasks" SET "check" = 1 WHERE "tasks"."id" = ?  [["id", nil]]