app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks"
SELECT "tasks".* FROM "tasks" WHERE "tasks"."check" = ?  [["check", 0]]
---
  def index
    @tasks = Task.all
    @tasks.where(check: 0)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "limit" = ? WHERE "tasks"."id" = ?  [["limit", Thu, 09 Mar 2017], ["id", 1]]
---
  def update
    @task = Task.find(params[:id])
    @task.update(post_params)

INSERT INTO "tasks" ("name", "details", "limit", "level_id") VALUES (?, ?, ?, ?)  [["name", "Tache 1"], ["details", "Tache 1"], ["limit", Sun, 26 Mar 2017], ["level_id", 1]]
---
  def create
    @task = Task.create(post_params)